{
  "CHE306264007": {
    "hash": "1d4905dbc191d429bfb09e9bc0c10264f0e5b85158a8598c3f7717740cf4fe8c",
    "updatedAt": "5.2.2026, 06:46:20",
    "name": "Justin Ben Thomas Multimedia"
  },
  "CHE415135958": {
    "hash": "fc9d4289de1678d58e6e2fa7128bc8a50abc63ddb38b2eb3a49328bbb428aeba",
    "updatedAt": "7.2.2026, 18:17:09",
    "name": "BCB Markets (Switzerland) Sàrl",
    "props": {
      "uid": "CHE415135958",
      "name": "BCB Markets (Switzerland) Sàrl",
      "legalSeat": "Zug",
      "legalForm": "Limited Liability Company (LLC)",
      "status": "ACTIVE",
      "purpose": "Die Gesellschaft bezweckt in erster Linie die Erbringung von Maklerdienstleistungen einschliesslich die Erfassung, Archivierung und Auswertung von Daten und deren Weitergabe an Dritte, unter Ausschluss aller dem Bundesgesetz über den Erwerb von Grundstücken durch Personen im Ausland unterstellten Geschäfte. Die Gesellschaft kann in der Schweiz und im Ausland Tochtergesellschaften und Zweigniederlassungen errichten und sich an anderen Unternehmungen im In- und Ausland beteiligen. Die Gesellschaft kann Liegenschaften im Zusammenhang mit dem Hauptzweck und Immaterialgüterrechten erwerben, halten und veräussern. Die Gesellschaft kann alle kommerziellen, finanziellen oder anderen Tätigkeiten ausüben, die direkt oder indirekt mit dem Gesellschaftszweck zusammenhängen. Die Gesellschaft kann Dritten oder Gesellschaften, an denen sie unmittelbar oder mittelbar beteiligt ist, sowie ihren unmittelbaren oder mittelbaren Anteilseignern und Gesellschaften, an denen solche Anteilseigner unmittelbar oder mittelbar beteiligt sind, Darlehen und/oder andere Formen der Finanzierung gewähren, auch im Rahmen eines entgeltlichen oder unentgeltlichen Cash-Poolings. Die Gesellschaft kann auch jede Art von Sicherheiten oder Garantien zur Sicherung ihrer Verpflichtungen oder der Verpflichtungen jeder dieser Personen leisten, einschliesslich in Form von Verpfändungen oder Sicherungsübereignungen, Verpfändungen, Garantien jeder Art oder entgeltlichen oder unentgeltlichen Freistellungsverpflichtungen. Die Gesellschaft kann solche Finanzierungen, Sicherheiten oder Garantien auch dann gewähren, wenn sie im ausschliesslichen Interesse von Dritten oder von Gesellschaften, an denen die Gesellschaft unmittelbar oder mittelbar beteiligt ist, sowie ihren unmittelbaren oder mittelbaren Anteilseignern und Gesellschaften, an denen solche Anteilseigner unmittelbar oder mittelbar beteiligt sind, geleistet werden.",
      "canton": "ZG",
      "capitalNominal": "70000",
      "capitalCurrency": "CHF",
      "address": {
        "organisation": "BCB Markets (Switzerland) Sàrl",
        "careOf": "",
        "street": "Bahnhofstrasse",
        "houseNumber": "7",
        "addon": "",
        "poBox": "",
        "city": "Zug",
        "swissZipCode": "6300"
      },
      "zefixDetailWeb": "https://www.zefix.admin.ch/en/search/entity/list?name=CHE415135958&directLink=true"
    }
  },
  "CHE466483743": {
    "hash": "45ef354088328427bf5288ff3eb427c5165637b73c6144ea8705771d2b842575",
    "updatedAt": "7.2.2026, 18:17:09",
    "name": "Connecting markets AG",
    "props": {
      "uid": "CHE466483743",
      "name": "Connecting markets AG",
      "legalSeat": "Zug",
      "legalForm": "Corporation (Ltd)",
      "status": "ACTIVE",
      "purpose": "Der Zweck des Unternehmens ist die Erbringung von Dienstleistungen im Finanzbereich. Die Gesellschaft kann im In- und Ausland Zweigniederlassungen und Tochtergesellschaften errichten, sich an anderen Unternehmen beteiligen oder sich mit diesen zusammenschliessen. Die Gesellschaft kann, auch ohne angemessene Gegenleistung, Geschäfte mit oder zugunsten von nahestehenden Personen, insbesondere ihren Aktionären sowie anderen Konzerngesellschaften, tätigen, namentlich Darlehen an diese Personen ausrichten oder Garantien, Bürgschaften, Pfandrechte oder andere Sicherheiten zur Sicherstellung ihrer Verbindlichkeiten stellen. Die Gesellschaft kann im In- und Ausland Grundstücke und Immaterialgüterrechte erwerben, halten, verwalten, belasten und veräussern. Die Gesellschaft kann alle Geschäfte tätigen, Verpflichtungen eingehen und Verträge abschliessen, die geeignet sind, den Gesellschaftszweck und die Entwicklung des Unternehmens zu fördern, oder die direkt oder indirekt damit im Zusammenhang stehen.",
      "canton": "ZG",
      "capitalNominal": "100000",
      "capitalCurrency": "CHF",
      "address": {
        "organisation": "Connecting markets AG",
        "careOf": "",
        "street": "Baarerstrasse",
        "houseNumber": "12",
        "addon": "",
        "poBox": "",
        "city": "Zug",
        "swissZipCode": "6300"
      },
      "zefixDetailWeb": "https://www.zefix.admin.ch/en/search/entity/list?name=CHE466483743&directLink=true"
    }
  },
  "CHE456113629": {
    "hash": "fd14e5b564fbc7f3a4d34e587613bbac70aba10ba074be1464a3b76e53576b80",
    "updatedAt": "7.2.2026, 18:17:09",
    "name": "Vivafi Digital AG",
    "props": {
      "uid": "CHE456113629",
      "name": "Vivafi Digital AG",
      "legalSeat": "Zug",
      "legalForm": "Corporation (Ltd)",
      "status": "ACTIVE",
      "purpose": "Der Zweck des Unternehmens besteht darin, Dienstleistungen im Bereich der Finanzvermittlung sowie im Zusammenhang mit digitalen Vermögenswerten und Zahlungslösungen anzubieten. Es kann Beratungs-, Technologie- und Verwaltungsdienstleistungen erbringen sowie alle kommerziellen und finanziellen Transaktionen durchführen, die mit seinem Zweck in Zusammenhang stehen. Die Gesellschaft kann Zweigniederlassungen und Tochtergesellschaften im In- und Ausland gründen, Beteiligungen an anderen Gesellschaften erwerben oder mit diesen fusionieren. Die Gesellschaft kann auch ohne angemessene Gegenleistung Geschäfte mit oder zugunsten von nahestehenden Personen, insbesondere ihren Aktionären und anderen Konzerngesellschaften, tätigen, insbesondere diesen Darlehen gewähren oder Garantien, Bürgschaften, Pfandrechte oder andere Sicherheiten zur Sicherung ihrer Verbindlichkeiten stellen. Die Gesellschaft kann Immobilien und Immaterialgüterrechte im In- und Ausland erwerben, halten, verwalten, belasten und veräussern. Die Gesellschaft kann alle Geschäfte tätigen, Verpflichtungen eingehen und Verträge abschliessen, die zur Förderung ihres Zweckes und zur Entwicklung des Unternehmens geeignet sind oder in direktem oder indirektem Zusammenhang damit stehen.",
      "canton": "ZG",
      "capitalNominal": "100000",
      "capitalCurrency": "CHF",
      "address": {
        "organisation": "Vivafi Digital AG",
        "careOf": "",
        "street": "Baarerstrasse",
        "houseNumber": "12",
        "addon": "",
        "poBox": "",
        "city": "Zug",
        "swissZipCode": "6300"
      },
      "zefixDetailWeb": "https://www.zefix.admin.ch/en/search/entity/list?name=CHE456113629&directLink=true"
    }
  },
  "CHE287007666": {
    "hash": "efad7f655702362e6535e3b2cadd54b483c183ab5a7d0f8760adb29d78152c42",
    "updatedAt": "7.2.2026, 18:17:09",
    "name": "Solstice Staking AG",
    "props": {
      "uid": "CHE287007666",
      "name": "Solstice Staking AG",
      "legalSeat": "Zug",
      "legalForm": "Corporation (Ltd)",
      "status": "ACTIVE",
      "purpose": "Der Zweck der Gesellschaft ist die Entwicklung, Vermarktung und Bereitstellung von Software im Finanzsektor. Die Gesellschaft kann Zweigniederlassungen und Tochtergesellschaften im In- und Ausland errichten und sich an anderen Unternehmen im In- und Ausland beteiligen sowie alle Geschäfte tätigen, die direkt oder indirekt mit ihrem Zweck in Zusammenhang stehen. Die Gesellschaft kann im In- und Ausland Grundeigentum und lmmaterialgüterrechte erwerben, verwerten, veräussern und verwalten. Insbesondere kann sie Finanzierungen für eigene oder fremde Rechnung vornehmen sowie Garantien und Bürgschaften für mittelbare und unmittelbare Tochtergesellschaften und Dritte eingehen. Sie kann ebenfalls direkt oder indirekt mit ihren verbundenen Gesellschaften entgeltlich oder unentgeltlich Darlehen oder andere Finanzierungen gewähren und Sicherheiten aller Art stellen.",
      "canton": "ZG",
      "capitalNominal": "100000",
      "capitalCurrency": "CHF",
      "address": {
        "organisation": "Solstice Staking AG",
        "careOf": "c/o Taidos AG",
        "street": "Gubelstrasse",
        "houseNumber": "15",
        "addon": "",
        "poBox": "",
        "city": "Zug",
        "swissZipCode": "6300"
      },
      "zefixDetailWeb": "https://www.zefix.admin.ch/en/search/entity/list?name=CHE287007666&directLink=true"
    }
  },
  "CHE405099930": {
    "hash": "ec553a37b9cecb04309de5728a96ada4efe8ade6660804263b3327f5492f454a",
    "updatedAt": "7.2.2026, 18:17:09",
    "name": "Montezy GmbH",
    "props": {
      "uid": "CHE405099930",
      "name": "Montezy GmbH",
      "legalSeat": "Zug",
      "legalForm": "Limited Liability Company (LLC)",
      "status": "ACTIVE",
      "purpose": "Die Gesellschaft bezweckt die Erbringung von Dienstleistungen insbesondere im Finanzsektor durch eine proprietäre Technologieplattform. Die Gesellschaft kann im In- und Ausland Zweigniederlassungen errichten, sich an anderen Unternehmungen irgendwelcher Art beteiligen, Vertretungen übernehmen sowie alle Geschäfte eingehen und Verträge abschliessen, die geeignet sein könnten, den Zweck der Gesellschaft zu fördern; oder die direkt oder indirekt damit im Zusammenhang stehen. Sie kann auch Finanzierungen für eigene oder fremde Rechnung sowie Garantien, Bürgschaften und Pfandrechtsgeschäfte für verbundene Unternehmungen und Dritte eingehen. Sie kann Immobilien im In- und Ausland erwerben, verpachten, vermieten, belasten und veräussern. Die Gesellschaft kann jede Art von Schuld oder Wertpapieren, innerhalb der Schweiz oder im Ausland, erwerben, halten, verwalten oder verkaufen.",
      "canton": "ZG",
      "capitalNominal": "20000",
      "capitalCurrency": "CHF",
      "address": {
        "organisation": "Montezy GmbH",
        "careOf": "",
        "street": "Baarerstrasse",
        "houseNumber": "12",
        "addon": "",
        "poBox": "",
        "city": "Zug",
        "swissZipCode": "6300"
      },
      "zefixDetailWeb": "https://www.zefix.admin.ch/en/search/entity/list?name=CHE405099930&directLink=true"
    }
  },
  "CHE199201424": {
    "hash": "93a3f9c48336b5c56946d0dd1f5f5418842f1a520b714d0e61d5403b0945f0fe",
    "updatedAt": "7.2.2026, 18:17:09",
    "name": "CL Global Solution GmbH",
    "props": {
      "uid": "CHE199201424",
      "name": "CL Global Solution GmbH",
      "legalSeat": "Risch",
      "legalForm": "Limited Liability Company (LLC)",
      "status": "ACTIVE",
      "purpose": "Zweck der Gesellschaft ist die Erbringung von Beratungsdienstleistungen und anderen Finanzvermittlungsaktivitäten. Die Gesellschaft kann Zweigniederlassungen und Tochtergesellschaften im In- und Ausland errichten und sich an anderen Unternehmen im In- und Ausland beteiligen sowie alle Geschäfte tätigen, die direkt oder indirekt mit ihrem Zweck in Zusammenhang stehen. Die Gesellschaft kann im In- und Ausland Grundeigentum erwerben, belasten, veräussern und verwalten. Sie kann auch Finanzierungen für eigene oder fremde Rechnung vornehmen sowie Garantien und Bürgschaften für Tochtergesellschaften und Dritte eingehen.",
      "canton": "ZG",
      "capitalNominal": "20000",
      "capitalCurrency": "CHF",
      "address": {
        "organisation": "CL Global Solution GmbH",
        "careOf": "",
        "street": "Lettenstrasse",
        "houseNumber": "9",
        "addon": "",
        "poBox": "",
        "city": "Rotkreuz",
        "swissZipCode": "6343"
      },
      "zefixDetailWeb": "https://www.zefix.admin.ch/en/search/entity/list?name=CHE199201424&directLink=true"
    }
  },
  "CHE316663219": {
    "hash": "a768c91a7b5ed0e6c33708db59fe0153e0198ef07ed606be70560486c8cc7f4d",
    "updatedAt": "7.2.2026, 18:17:09",
    "name": "BlancBlock Digital AG",
    "props": {
      "uid": "CHE316663219",
      "name": "BlancBlock Digital AG",
      "legalSeat": "Zug",
      "legalForm": "Corporation (Ltd)",
      "status": "ACTIVE",
      "purpose": "Der Zweck des Unternehmens ist die Erbringung von Dienstleistungen im Finanzbereich insbesondere im Bereich virtueller Vermögenswerte. Die Gesellschaft kann im In- und Ausland Zweigniederlassungen und Tochtergesellschaften errichten, sich an anderen Unternehmen beteiligen oder sich mit diesen zusammenschliessen. Die Gesellschaft kann, auch ohne angemessene Gegenleistung, Geschäfte mit oder zugunsten von nahestehenden Personen, insbesondere ihren Aktionären sowie anderen Konzerngesellschaften, tätigen, namentlich Darlehen an diese Personen ausrichten oder Garantien, Bürgschaften, Pfandrechte oder andere Sicherheiten zur Sicherstellung ihrer Verbindlichkeiten stellen. Die Gesellschaft kann im In- und Ausland Grundstücke und Immaterialgüterrechte erwerben, halten, verwalten, belasten und veräussern. Die Gesellschaft kann alle Geschäfte tätigen, Verpflichtungen eingehen und Verträge abschliessen, die geeignet sind, den Gesellschaftszweck und die Entwicklung des Unternehmens zu fördern, oder die direkt oder indirekt damit im Zusammenhang stehen.",
      "canton": "ZG",
      "capitalNominal": "100000",
      "capitalCurrency": "CHF",
      "address": {
        "organisation": "BlancBlock Digital AG",
        "careOf": "",
        "street": "Baarerstrasse",
        "houseNumber": "12",
        "addon": "",
        "poBox": "",
        "city": "Zug",
        "swissZipCode": "6300"
      },
      "zefixDetailWeb": "https://www.zefix.admin.ch/en/search/entity/list?name=CHE316663219&directLink=true"
    }
  },
  "CHE270214688": {
    "hash": "51ae3e8c20d7a7d56206970e1acb8f9775fa10b90a7c89ab0194f0e793b64bba",
    "updatedAt": "7.2.2026, 18:17:09",
    "name": "Monexa AG",
    "props": {
      "uid": "CHE270214688",
      "name": "Monexa AG",
      "legalSeat": "Zug",
      "legalForm": "Corporation (Ltd)",
      "status": "ACTIVE",
      "purpose": "Der Zweck des Unternehmens besteht in der Erbringung von Dienstleistungen als Virtual Asset Service Provider (VASP) und anderer Finanzintermediationstätigkeiten. Die Gesellschaft kann im In- und Ausland Zweigniederlassungen und Tochtergesellschaften errichten, sich an anderen Unternehmungen irgendwelcher Art beteiligen, Vertretungen übernehmen sowie alle Geschäfte eingehen und Verträge abschliessen, die geeignet sein könnten, den Zweck der Gesellschaft zu fördern; oder die direkt oder indirekt damit im Zusammenhang stehen. Sie kann auch Finanzierungen für eigene oder fremde Rechnung sowie Garantien, Bürgschaften und Pfandrechtsgeschäfte für verbundene Unternehmungen und Dritte eingehen. Sie kann Immobilien im In- und Ausland erwerben, verpachten, vermieten, verwalten, belasten und veräussern. Die Gesellschaft kann jede Art von Schuld oder Wertpapieren, innerhalb der Schweiz oder im Ausland, erwerben, halten, verwalten oder verkaufen.",
      "canton": "ZG",
      "capitalNominal": "100000",
      "capitalCurrency": "CHF",
      "address": {
        "organisation": "Monexa AG",
        "careOf": "",
        "street": "Baarerstrasse",
        "houseNumber": "12",
        "addon": "",
        "poBox": "",
        "city": "Zug",
        "swissZipCode": "6300"
      },
      "zefixDetailWeb": "https://www.zefix.admin.ch/en/search/entity/list?name=CHE270214688&directLink=true"
    }
  }
}